// About.tsx
import React, { useEffect } from 'react';
import { useJsApiLoader } from '@react-google-maps/api';
import Map from '../components/Map';
import VideosModal from '../components/VideosModal';
const containerStyle: React.CSSProperties = {
  width: '100%',
  height: '40vh'
};

const vitiLocation: google.maps.LatLngLiteral = {
  lat: 50.43012204275398,
  lng: 30.54400779179949
};

const About: React.FC = () => {
  const { isLoaded } = useJsApiLoader({
    id: 'google-map-script',
    googleMapsApiKey: "AIzaSyBqVMbGUagGhsttUJGP68IX1nb_XkmWvFQ" // Replace with your API key
  });
  // useEffect(() => { }, [])

  return (<>

    <section className="about text-black">
      <article>
        <h2>Про нашу організацію</h2>
        <p>
          Ми — команда відданих журналістів і редакторів, які присвятили свою роботу збору та поширенню об'єктивної та актуальної інформації про війну в Україні. Наша місія — забезпечити чесне та вичерпне висвітлення подій, які відбуваються, і розкрити героїзм та силу українського народу у цей непростий час.
        </p>
        <p>
          Як ми працюємо:
        </p>
        <p>
          Об'єктивність та Достовірність:<br />
          Ми прагнемо до максимальної об'єктивності у висвітленні подій. Наша робота базується на перевірених фактах та достовірних джерелах.
        </p>
        <p>
          Шанування Гідності:<br />
          Ми визнаємо гідність всіх сторін конфлікту та ретельно ставимося до прав людини, намагаючись уникати будь-якої форми пристрасті чи стереотипів.
        </p>
        <p>
          Глибина Аналізу:<br />
          Наші журналісти вивчають події з урахуванням історичного контексту та глибини аналізу, щоб надати нашим читачам повну картину ситуації.
        </p>
        <p>
          Підтримка Жертв та Мирного Співжиття:<br />
          Ми акцентуємо увагу на стражданнях мирного населення та засуджуємо будь-які дії, спрямовані на вчинення насильства щодо цивільних осіб.
        </p>
      </article>


      <article className="text-black">
        <h3>Підтримати сайт</h3>
        <p>
          Ми вкладаємо свої зусилля та ресурси у створення якісного контенту та удосконалення нашого сервісу. Ваша підтримка має велике значення для нас і допомагає нам забезпечувати вам ще кращі можливості
        </p>
        <a href="#">Підтримати</a>
      </article>
    </section>
    <div className='w-full overflow-hidden'>
      {isLoaded ? (
        <Map
          mapContainerStyle={containerStyle}
          center={vitiLocation}
          zoom={13}
          markerPosition={vitiLocation}
          markerIcon={{ url: 'data:image/svg+xml;utf8,<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 24 24"><path d="M19.527 4.799c1.212 2.608.937 5.678-.405 8.173-1.101 2.047-2.744 3.74-4.098 5.614-.619.858-1.244 1.75-1.669 2.727-.141.325-.263.658-.383.992-.121.333-.224.673-.34 1.008-.109.314-.236.684-.627.687h-.007c-.466-.001-.579-.53-.695-.887-.284-.874-.581-1.713-1.019-2.525-.51-.944-1.145-1.817-1.79-2.671L19.527 4.799zM8.545 7.705l-3.959 4.707c.724 1.54 1.821 2.863 2.871 4.18.247.31.494.622.737.936l4.984-5.925-.029.01c-1.741.601-3.691-.291-4.392-1.987a3.377 3.377 0 0 1-.209-.716c-.063-.437-.077-.761-.004-1.198l.001-.007zM5.492 3.149l-.003.004c-1.947 2.466-2.281 5.88-1.117 8.77l4.785-5.689-.058-.05-3.607-3.035zM14.661.436l-3.838 4.563a.295.295 0 0 1 .027-.01c1.6-.551 3.403.15 4.22 1.626.176.319.323.683.377 1.045.068.446.085.773.012 1.22l-.003.016 3.836-4.561A8.382 8.382 0 0 0 14.67.439l-.009-.003zM9.466 5.868L14.162.285l-.047-.012A8.31 8.31 0 0 0 11.986 0a8.439 8.439 0 0 0-6.169 2.766l-.016.018 3.665 3.084z"/></svg>' }}
        />
      ) : <></>}
    </div>
  </>
  );
};

export default About;
